multipleLayeringFvMesh/run/pantographB/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     scalarTransportDyMFoamMC;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         1;

deltaT          0.0006631546;

writeControl    timeStep;

writeInterval   20;

cycleWrite      0;

writeFormat     ascii;

writeCompression uncompressed;

timeFormat      general;

runTimeModifiable yes;

adjustTimeStep   no;

maxCo            0.5;

/*libs
(
    "libdynamicMeshMC.so"
);*/
// ************************************************************************* //
