multipleLayeringFvMesh/run/pantographB/0/V
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      V;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 3 0 0 0 0 0];

internalField   nonuniform List<scalar> 
40000
(
2.5e-05
2.5e-05
2.5e-05
2.5e-05
2.5e-05
2.5e-05
2.5e-05
2.5e-05
...
)
;

boundaryField
{
    bottom
    {
        type            calculated;
        value           nonuniform List<scalar> 
200
(
0.005
0.005
0.005
0.005
0.005
0.005
0.005
0.005
...
)
;
    }
    top
    {
        type            calculated;
        value           nonuniform List<scalar> 
200
(
0.005
0.005
0.005
0.005
0.005
0.005
0.005
0.005
...
)
;
    }
    left
    {
        type            calculated;
        value           nonuniform List<scalar> 
200
(
0.005
0.005
0.005
0.005
0.005
0.005
0.005
0.005
...
)
;
    }
    right
    {
        type            calculated;
        value           nonuniform List<scalar> 
200
(
0.005
0.005
0.005
0.005
0.005
0.005
0.005
0.005
...
)
;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
