multipleLayeringFvMesh/run/pantographB/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM Extend Project: Open Source CFD        |
|  \\    /   O peration     | Version:  1.6-ext                               |
|   \\  /    A nd           | Web:      www.extend-project.de                 |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
	
    /*cellMotionUy
    {
        solver          PCG;
        preconditioner  DIC;
        tolerance       1e-08;
        relTol          0.001;
	}
    */

    T
    {
        solver          PBiCG;
        preconditioner  DILU;
        tolerance       1e-12;
        relTol          0;
	    maxIter	        40;
    }
}

SIMPLE
{
    nNonOrthogonalCorrectors 0;
}

// ************************************************************************* //
